In [6]:
import pandas as pd     

student = {
    "student": ["samay", "ranay", "george"],
    "score": [22, 42, 45]
}

student_df = pd.DataFrame(student)

for index, row in student_df.iterrows(): 
    print(row['student'])  
student_df

samay
ranay
george

  student  score
0   samay     22
1   ranay     42
2  george     45

In [2]:
import pandas as pd

dict = {
    
    "name" : ['hari', 'ramu', 'bhola', 'shambhu'],
    "marks" : [33,53,54,55],
    "city" : ["squadpur", "dibrupur", "dholkabad", "shambhgaon"]
    
    
}

dict_df = pd.DataFrame(dict)
dict_df

      name  marks        city
0     hari     33    squadpur
1     ramu     53    dibrupur
2    bhola     54   dholkabad
3  shambhu     55  shambhgaon

In [3]:

dict_df.to_csv('friends.csv')

In [18]:
dict_df.to_csv('friends_False.csv', index=False)

In [5]:
dict_df.head(2)
# dict_df.city

   name  marks      city
0  hari     33  squadpur
1  ramu     53  dibrupur

In [16]:
dict_df.describe()

           marks
count   4.000000
mean   48.750000
std    10.531698
min    33.000000
25%    48.000000
50%    53.500000
75%    54.250000
max    55.000000

In [17]:
dict_df.describe

<bound method NDFrame.describe of       name  marks        city
0     hari     33    squadpur
1     ramu     53    dibrupur
2    bhola     54   dholkabad
3  shambhu     55  shambhgaon>

In [9]:
# dict_df.index = ['first', 'second','third']

a = dict_df['name']
print(a)

0       hari
1       ramu
2      bhola
3    shambhu
Name: name, dtype: object

In [15]:
dict_df.loc[0]

name         hari
marks          33
city     squadpur
Name: 0, dtype: object

In [16]:
dict_df.loc[:,['name']]

      name
0     hari
1     ramu
2    bhola
3  shambhu